applcation/app/controllers/dash_boards_controller.rb

SELECT "dash_boards".* FROM "dash_boards" WHERE (link_role='Employee') ORDER BY id ASC
---
  def index
    @dash_boards = DashBoard.all

SELECT  "dash_boards".* FROM "dash_boards" WHERE "dash_boards"."link_name" = $1 LIMIT $2  [["link_name", "HR Links"], ["LIMIT", 1]]
SELECT "link_details".* FROM "link_details" WHERE "link_details"."dash_board_id" = $1  [["dash_board_id", 2]]
---
 def check_link_details
  @details = DashBoard.find_by_link_name(params[:name]).link_details

 render json: { "stat": @details.present? }

SELECT  "dash_boards".* FROM "dash_boards" WHERE "dash_boards"."link_name" = $1 LIMIT $2  [["link_name", "HR Links"], ["LIMIT", 1]]
---
  def load_link_details
 @link_details = DashBoard.find_by_link_name(params[:name]).link_details

SELECT "employees".* FROM "employees" WHERE (level ='CEO')
---
def show_organization_chart
@ceo_emp = Employee.where("level =?" ,  "CEO")

SELECT  "dash_boards".* FROM "dash_boards" WHERE "dash_boards"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_dash_board
      @dash_board = DashBoard.find(params[:id])