applcation/app/controllers/employees_controller.rb

  def check_employee_type

if params[:type] == "Employee"

@employee_typ = Employee.where("level = ?","Manager")
---
SELECT  "employees".* FROM "employees" WHERE "employees"."employee_type" = $1 LIMIT $2  [["employee_type", "CEO"], ["LIMIT", 1]]