applcation/app/controllers/employees_controller.rb

INSERT INTO "employees" ("name", "designation", "image_url", "addres", "year", "month", "date", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @employee = Employee.new(employee_params)
    @employee.date = params[:employees]["written_on(3i)"]
    @employee.month = params[:employees]["written_on(2i)"]
    @employee.year = params[:employees]["written_on(1i)"]
    @employee.user_id = current_user.id
    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "designation" = $1, "updated_at" = $2 WHERE "employees"."id" = $3  [["designation", "developer"], ["updated_at", "2018-05-02 10:56:32.756542"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)