applcation/app/views/_show_links.html.erb

SELECT "dash_boards".* FROM "dash_boards" WHERE (link_role='Employee') ORDER BY id ASC
---
<table align='center' class="tablecss" cellspacing=0 cellpadding=5 align=center width="100%" >
<%current_user.has_role?(:employee) ? @links = DashBoard.where("link_role=?", 'Employee').order('id ASC') : @links = DashBoard.all.order('id ASC')%>