applcation/app/views/employees/check_employee_type.html.erb

SELECT "employees".* FROM "employees"
---

  <td colspan = "1"><%= collection_select(:employee,:name, Employee.all,:id,:name) %></td>